 /* Абстрактные классы классхое мебошанд ки мисли класи обычный астанд вале фаркияташон он аст ки объекти ин классхо
 сохта намешавад. Онхоро класси хаёли хам гуем мешавад. Мисол Person Shape Animal and etc. Агар дар умум
 бинем мисол фигура факат дар хаёл аст яъне чизи вокеи нест агар 3кунча гуем мо алакай медонем чиро дар назар дорем 
 барои хамин гуна холатхо классхои abstract месозан ва дигар клаасхо аз он мерос мегиранд. 
 Чунин классхо методхои абстракти доранд ки тело надоранд аммо дар класи бачаги хатман бояд override шаванд. 
 abstract class Animal
{
    public abstract string Sound();
} 
class Dog: Animal
{
    public override string Sound()
    {
        return "aw aw";
    }
}
 */