/* Фаркияти асосии байни List<> ва массив дар он аст ки барои сохтани массив мо бояд размери (size) массивро 

дохил намоем аммо дар лист баръакс мо метавонем лист созем ва размер намонем вай худаш ба таври автомати 
зиёд шудан мегирад. 
1. int[] array=new int[5]; 
2. List<int> list=new List<int>();   
Дар мисоли болоовардашуда дида мешавад ки дарозии массив нишон дода шудааст дар лист бошад чунин нест. 
Ин мани дорад ки массив 5 елемент кабул мекунад вале лист, чикадар елемент ки дохил кунем кабул мекунад*/