 /*Наследование ё ки Inheritance яке аз шохахои асосии ООП буда додугирифти байни 2 класро дар бар мегирад. 
 Ба таври дигар наследование ин истифодаи як класс функционалхои класси дигар аст. Класе ки мерос медихад
 base class(parent)  ва классе ки мерос мегирад derived(child) классю
 Мисол: Одам дар умум ном дорад, сину сол дорад милаат ва гайрахо дорад. Агар аз тарафи дигар бинем Муаллим, 
 талаба коргар низ ин хусусиятхоро дорадб яъне охамаи онхо одаманд вале фаолияти гуногун доранд. 
 Мо метавонем одамро класси асоси ва студент муаллим ё коргарро класи бачаги ном барем. 
 class Person
{
    public int Age { get; set; }
    public string  Name { get; set; }
}  

class Student: Person
{

} 
class Employee:Person
{

} 

Дар мисоли мазкур base class Person and derived class are Student,Employee  */